Router1
config term
Enter configuration commands, one per line.  End with CNTL/Z.
Router1(config)#router ospf 100
Router1(config-router)# area 0 range 174.208.128.0 255.255.128.0 not-advertise  cost 177
Router1(config-router)# default-information originate  always  metric 47 metric-type 2
Router1(config-router)# default-metric 78
Router1(config-router)# redistribute connected
% Only classful networks will be redistributed
Router1(config-router)#exit
Router1(config)#router bgp 2
Router1(config-router)# bgp bestpath compare-routerid
Router1(config-router)# no bgp client-to-client reflection
Router1(config-router)# bgp dampening  route-map map3
Router1(config-router)# distance bgp 187 11 236
Router1(config-router)# redistribute connected  route-map map4
% "map4" used as redistribute connected into bgp route-map, community match not supported
% not supported match will behave as route-map with no match
% "map4" used as redistribute connected into bgp route-map, set comm-list not supported
Router1(config-router)# synchronization
Router1(config-router)# table-map map5
Router1(config-router)# neighbor 197.108.167.2 default-originate  route-map map6
Router1(config-router)#exit
Router1(config)#interface FastEthernet0/0
Router1(config-if)#no ip ospf cost 57
Router1(config-if)#no ip ospf priority
Router1(config-if)#exit
Router1(config)#interface FastEthernet0/1
Router1(config-if)#no ip ospf cost 55
Router1(config-if)#exit
Router1(config)#router ospf 100
Router1(config-router)#no auto-cost reference-bandwidth 37
% OSPF: Reference bandwidth is changed. 
        Please ensure reference bandwidth is consistent across all routers.
Router1(config-router)#compatible rfc1583
Router1(config-router)#no distance 210
Router1(config-router)#no redistribute static  subnets
Router1(config-router)#exit
Router1(config)#router bgp 2
Router1(config-router)#no bgp bestpath med confed  missing-as-worst
Router1(config-router)#no bgp bestpath med missing-as-worst
Router1(config-router)#no bgp deterministic-med
Router1(config-router)#no auto-summary
Router1(config-router)#no aggregate-address 139.170.86.0 255.255.255.0 as-set  summary-only
Router1(config-router)#no neighbor 181.236.228.1 maximum-prefix 1113
Router1(config-router)#no neighbor 181.236.228.1 route-reflector-client
% Invalid command. Not an internal neighbor
Router1(config-router)#no neighbor 197.108.167.2 route-reflector-client
% Invalid command. Not an internal neighbor
Router1(config-router)#no neighbor 181.236.228.1 weight 63004
Router1(config-router)#exit
Router1(config)#no ip route 139.170.86.0 255.255.255.254 FastEthernet0/1
Router1(config)#no ip route 197.212.160.0 255.255.240.0 FastEthernet0/1
Router1(config)#ip prefix-list list3 seq 56  permit  159.204.194.0/27 le 32
Router1(config)#ip prefix-list list4 seq 59  deny  128.0.0.0/1 ge 2 le 23
Router1(config)#ip prefix-list list4 seq 27  deny  216.0.0.0/28
Router1(config)#ip prefix-list list4 seq 29  permit  159.192.0.0/10 le 28
Router1(config)#ip prefix-list list4 seq 44  deny  159.204.192.0/22 ge 23 le 25
Router1(config)# route-map map3  deny  27
Router1(config-route-map)# match ip address prefix-list list5
Router1(config-route-map)# match community 478
Router1(config-route-map)# route-map map3  permit  72
Router1(config-route-map)# route-map map3  deny  38
Router1(config-route-map)# set ip next-hop 216.0.0.6
Router1(config-route-map)# route-map map3  deny  63
Router1(config-route-map)# match ip address prefix-list list6
Router1(config-route-map)# set community local-as
Router1(config-route-map)# set local-preference 67
Router1(config-route-map)# route-map map3  deny  33
Router1(config-route-map)# match ip address prefix-list list7
Router1(config-route-map)# set as-path prepend 491
Router1(config-route-map)# route-map map4  permit  63
Router1(config-route-map)# match as-path 129
Router1(config-route-map)# set ip next-hop 159.204.196.20
Router1(config-route-map)# set community 735
Router1(config-route-map)# set as-path prepend 687
Router1(config-route-map)# route-map map5  permit  34
Router1(config-route-map)# match as-path 72
Router1(config-route-map)# set ip next-hop 174.208.183.14
Router1(config-route-map)# set comm-list 86 delete
Router1(config-route-map)# route-map map5  permit  53
Router1(config-route-map)# set as-path prepend 706
Router1(config-route-map)# route-map map5  deny  91
Router1(config-route-map)# match community 11
Router1(config-route-map)# match as-path 21
Router1(config-route-map)# route-map map5  deny  60
Router1(config-route-map)# match community 166
Router1(config-route-map)# match ip address prefix-list list8
Router1(config-route-map)# route-map map6  permit  16
Router1(config-route-map)# set ip next-hop 181.96.141.11
Router1(config-route-map)# set metric 625
Router1(config-route-map)# route-map map6  permit  98
Router1(config-route-map)# route-map map6  deny  47
Router1(config-route-map)# match community 52
Router1(config-route-map)# set comm-list 53 delete
Router1(config-route-map)# set weight 767
Router1(config-route-map)# set metric -665
Router1(config-route-map)# set local-preference 207
Router1(config-route-map)# set community local-as
Router1(config-route-map)# route-map map6  permit  50
Router1(config-route-map)# match ip address prefix-list list9
Router1(config-route-map)# match as-path 89
Router1(config-route-map)#end
Router1#


Router0
config term
Enter configuration commands, one per line.  End with CNTL/Z.
Router0(config)#interface FastEthernet0/1
Router0(config-if)# ip ospf cost 26
Router0(config-if)#exit
Router0(config)#router ospf 100
Router0(config-router)# no compatible rfc1583
Router0(config-router)# default-information originate  metric 99 metric-type 2
Router0(config-router)# default-metric 39
Router0(config-router)# redistribute static
% Only classful networks will be redistributed
Router0(config-router)#exit
Router0(config)#router bgp 1
Router0(config-router)# bgp always-compare-med
Router0(config-router)# distance bgp 137 36 251
Router0(config-router)# redistribute connected
Router0(config-router)# neighbor 188.19.105.2 route-map map1 out
Router0(config-router)# neighbor 188.19.105.2 route-reflector-client
% Invalid command. Not an internal neighbor
Router0(config-router)# neighbor 188.19.105.2 weight 31253
Router0(config-router)#exit
Router0(config)#interface FastEthernet0/1
Router0(config-if)#no ip ospf priority
Router0(config-if)#exit
Router0(config)#router ospf 100
Router0(config-router)#no distance 177
Router0(config-router)#no redistribute bgp 1
Router0(config-router)#no max-metric router-lsa  external-lsa 6470933 include-stub  summary-lsa 14441047
Router0(config-router)#exit
Router0(config)#router bgp 1
Router0(config-router)#no bgp deterministic-med
Router0(config-router)#no auto-summary
Router0(config-router)#no bgp dampening
Router0(config-router)#no redistribute static
Router0(config-router)#no table-map map2
Router0(config-router)#no aggregate-address 159.192.0.0 255.192.0.0
Router0(config-router)#no neighbor 181.236.228.2 maximum-prefix 9353
Router0(config-router)#no neighbor 188.19.105.2 update-source FastEthernet0/1
Router0(config-router)#no neighbor 181.236.228.2 capability orf prefix-list  send
Router0(config-router)#no neighbor 188.19.105.2 capability orf prefix-list  both
Router0(config-router)#exit
Router0(config)#no route-map map2
Router0(config)#no ip route 174.0.0.0 254.0.0.0 FastEthernet0/0
Router0(config)#ip prefix-list list2 seq 45  deny  128.0.0.0/2 le 18
Router0(config)#ip prefix-list list2 seq 18  permit  160.0.0.0/4 ge 29
Router0(config)#ip prefix-list list2 seq 51  deny  159.204.192.0/20
Router0(config)#ip prefix-list list2 seq 47  permit  139.170.86.0/31 ge 32
Router0(config)#ip prefix-list list2 seq 3  deny  159.204.194.0/24 ge 31
Router0(config)#ip prefix-list list3 seq 20  permit  159.204.194.0/26 le 28
Router0(config)#ip prefix-list list3 seq 24  deny  174.208.128.0/22 ge 23
Router0(config)#ip prefix-list list3 seq 71  permit  159.204.194.0/26 ge 31
Router0(config)#ip prefix-list list3 seq 46  deny  159.204.192.0/27 ge 29 le 32
Router0(config)#ip prefix-list list3 seq 16  deny  159.204.0.0/15 ge 30
Router0(config)# route-map map1  permit  70
Router0(config-route-map)# match as-path 155
Router0(config-route-map)# route-map map1  deny  97
Router0(config-route-map)# match ip address prefix-list list4
Router0(config-route-map)# set metric 181
Router0(config-route-map)# set local-preference 572
Router0(config-route-map)# route-map map1  deny  68
Router0(config-route-map)# match ip address prefix-list list5
Router0(config-route-map)# match community 402
Router0(config-route-map)# set weight 10
% "map1" used as BGP outbound route-map, set weight not supported
% "map1" used as BGP outbound route-map, set weight not supported
Router0(config-route-map)# set local-preference 557
Router0(config-route-map)#end
Router0#


Router2
config term
Enter configuration commands, one per line.  End with CNTL/Z.
Router2(config)#router ospf 100
Router2(config-router)# area 0 range 128.0.0.0 128.0.0.0 advertise
Router2(config-router)# no compatible rfc1583
Router2(config-router)# default-metric 84
Router2(config-router)# distance 173
Router2(config-router)# redistribute static  subnets
Router2(config-router)#exit
Router2(config)#router bgp 3
Router2(config-router)# bgp always-compare-med
Router2(config-router)# bgp default local-preference 132
Router2(config-router)# neighbor 197.108.167.1 route-map map4 out
% "map4" used as BGP outbound route-map, set weight not supported
% "map4" used as BGP outbound route-map, set weight not supported
Router2(config-router)# neighbor 188.19.105.1 default-originate
Router2(config-router)# neighbor 197.108.167.1 default-originate  route-map map5
% "map4" used as BGP outbound route-map, set weight not supported
Router2(config-router)# neighbor 188.19.105.1 route-reflector-client
% Invalid command. Not an internal neighbor
Router2(config-router)# neighbor 197.108.167.1 weight 8217
Router2(config-router)#exit
Router2(config)#ip route 128.0.0.0 128.0.0.0 FastEthernet0/1
Router2(config)#interface FastEthernet0/1
Router2(config-if)#no ip ospf cost 27
Router2(config-if)#exit
Router2(config)#no ip route 128.0.0.0 128.0.0.0 FastEthernet0/1
Router2(config)#no route-map map2
Router2(config)#router ospf 100
Router2(config-router)#no auto-cost reference-bandwidth 111
% OSPF: Reference bandwidth is changed. 
        Please ensure reference bandwidth is consistent across all routers.
Router2(config-router)#exit
Router2(config)#router bgp 3
Router2(config-router)#no bgp bestpath compare-routerid
Router2(config-router)# bgp client-to-client reflection
Router2(config-router)#no bgp maxas-limit
Router2(config-router)#no redistribute connected  route-map map2
Router2(config-router)#no synchronization
Router2(config-router)#no neighbor 197.108.167.1 route-reflector-client
% Invalid command. Not an internal neighbor
Router2(config-router)#no neighbor 188.19.105.1 weight 32115
Router2(config-router)#exit
Router2(config)#ip prefix-list list1 seq 43  permit  159.192.0.0/31
Router2(config)#ip prefix-list list1 seq 42  deny  159.204.194.0/24 ge 30 le 31
Router2(config)#ip prefix-list list1 seq 38  deny  128.0.0.0/1 ge 23
Router2(config)#ip prefix-list list2 seq 41  permit  128.0.0.0/1 le 15
Router2(config)#ip prefix-list list2 seq 85  permit  159.204.0.0/15
Router2(config)#ip prefix-list list2 seq 42  deny  197.212.160.0/21 ge 23
Router2(config)#ip prefix-list list2 seq 89  permit  156.0.0.0/6 ge 30 le 32
Router2(config)#ip prefix-list list3 seq 88  permit  159.192.0.0/19 ge 20 le 25
Router2(config)#ip prefix-list list3 seq 66  permit  159.192.0.0/25 ge 31
Router2(config)#ip prefix-list list4 seq 3  deny  159.192.0.0/10
Router2(config)#ip prefix-list list4 seq 26  permit  128.0.0.0/22 ge 30 le 32
Router2(config)#ip prefix-list list4 seq 85  permit  156.0.0.0/6
Router2(config)#ip prefix-list list4 seq 65  deny  176.0.0.0/4 ge 23
Router2(config)#ip prefix-list list5 seq 45  deny  160.0.0.0/20
Router2(config)#ip prefix-list list5 seq 87  permit  159.204.194.0/27 le 28
Router2(config)#ip prefix-list list5 seq 39  deny  174.208.128.0/22
Router2(config)# route-map map4  deny  97
% "map4" used as BGP outbound route-map, set weight not supported
% "map4" used as BGP outbound route-map, set weight not supported
Router2(config-route-map)# match ip address prefix-list list6
% "map4" used as BGP outbound route-map, set weight not supported
% "map4" used as BGP outbound route-map, set weight not supported
Router2(config-route-map)# match as-path 133
% "map4" used as BGP outbound route-map, set weight not supported
% "map4" used as BGP outbound route-map, set weight not supported
Router2(config-route-map)# set origin egp 389
% "map4" used as BGP outbound route-map, set weight not supported
% "map4" used as BGP outbound route-map, set weight not supported
Router2(config-route-map)# set comm-list 316 delete
% "map4" used as BGP outbound route-map, set weight not supported
% "map4" used as BGP outbound route-map, set weight not supported
Router2(config-route-map)# route-map map5  permit  66
Router2(config-route-map)# set origin igp
Router2(config-route-map)# set ip next-hop 139.170.86.0
Router2(config-route-map)# set local-preference 459
Router2(config-route-map)# set comm-list 9 delete
Router2(config-route-map)# route-map map5  permit  3
Router2(config-route-map)# set metric -772
Router2(config-route-map)#end
Router2#


